/*
Copyright (c) 2010, Code Aurora Forum. All rights reserved.

Redistribution and use in source and binary forms, with or without
modification, are permitted provided that the following conditions are
met:
    * Redistributions of source code must retain the above copyright
      notice, this list of conditions and the following disclaimer.
    * Redistributions in binary form must reproduce the above
      copyright notice, this list of conditions and the following
      disclaimer in the documentation and/or other materials provided
      with the distribution.
    * Neither the name of Code Aurora Forum, Inc. nor the names of its
      contributors may be used to endorse or promote products derived
      from this software without specific prior written permission.

THIS SOFTWARE IS PROVIDED "AS IS" AND ANY EXPRESS OR IMPLIED
WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT
ARE DISCLAIMED.  IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS
BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR
BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE
OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN

#define REG_3029                             0x3029
#define REG_302B                             0x302B

/* Pixel option setting */
#define REG_PIXEL_BIAS                       0x301C
#define REG_ALL_TX_OFF                       0x30D8

/* ADLC SETTING */
#define REG_L_ADLC_BPR                       0x3070
#define REG_F_L_ADLC_MAX                     0x3071
#define REG_F_ADLC_FILTER_A                  0x3080
#define REG_F_ADLC_FILTER_B                  0x3081

#define REG_SEL_CCP                          0x30BD
#define REG_SYNC_MODE                        0x3084
#define REG_M_PCLK_DIV                       0x30BE
#define REG_PACK_VIDEO_ENABLE                0x30C1
#define REG_DPHY_ENABLE                      0x30EE
#define REG_EMBEDDED_DATA_OFF                0x3111
#define REG_OUTIF_NUM_OF_LANES               0x30E2
#define REG_DPHY_BAND_CTRL                   0x30F1

#define REG_COARSE_INTEGRATION_TIME          0x0202
#define REG_COARSE_INTEGRATION_TIME_LSB      0x0203
#define REG_ANALOGUE_GAIN_CODE_GLOBAL_MSB    0x0204
#define REG_ANALOGUE_GAIN_CODE_GLOBAL_LSB    0x0205

/* Frame Fotmat */
#define REG_FRAME_LENGTH_LINES_MSB           0x0340
#define REG_FRAME_LENGTH_LINES_LSB           0x0341
#define REG_LINE_LENGTH_PCK_MSB              0x0342
#define REG_LINE_LENGTH_PCK_LSB              0x0343

/* PLL Registers */
#define REG_PRE_PLL_CLK_DIV                  0x0305
#define REG_PLL_MULTIPLIER_MSB               0x0306
#define REG_PLL_MULTIPLIER_LSB               0x0307
#define REG_VT_SYS_CLK_DIV                   0x30B5

/* Reserved register */
#define REG_H_BINNING                        0x30A9
#define REG_V_BINNING                        0x300E

/* Binning */
#define REG_X_EVEN_INC_MSB                   0x0380
#define REG_X_EVEN_INC_LSB                   0x0381
#define REG_X_ODD_INC_MSB                    0x0382
#define REG_X_ODD_INC_LSB                    0x0383
#define REG_Y_EVEN_INC_MSB                   0x0384
#define REG_Y_EVEN_INC_LSB                   0x0385
#define REG_Y_ODD_INC_MSB                    0x0386
#define REG_Y_ODD_INC_LSB                    0x0387

/*MIPI Size Setting for preview*/
#define REG_X_ADDR_START_MSB                 0x0344
#define REG_X_ADDR_START_LSB                 0x0345
#define REG_X_ADDR_END_MSB                   0x0348
#define REG_X_ADDR_END_LSB                   0x0349
#define REG_Y_ADDR_START_MSB                 0x0346
#define REG_Y_ADDR_START_LSB                 0x0347
#define REG_Y_ADDR_END_MSB                   0x034A
#define REG_Y_ADDR_END_LSB                   0x034B

/* Output Size */
#define REG_X_OUTPUT_SIZE_MSB                0x034C
#define REG_X_OUTPUT_SIZE_LSB                0x034D
#define REG_Y_OUTPUT_SIZE_MSB                0x034E
#define REG_Y_OUTPUT_SIZE_LSB                0x034F
#define REG_OUTIF_VIDEO_DATA_TYPE1           0x30BF
#define REG_OUTIF_OFFSET_VIDEO               0x30C0
#define REG_VIDEO_DATA_LENGTH_MSB            0x30C8
#define REG_VIDEO_DATA_LENGTH_LSB            0x30C9

#define REG_30BC                             0x30BC

struct reg_struct {
	/* CDS timing setting ... */
	uint8_t ld_start;                          /* 0x3000 */
	uint8_t sl_start;                          /* 0x3001 */
	uint8_t rx_start;                          /* 0x3002 */
	uint8_t cds_start;                         /* 0x3003 */
	uint8_t smp_width;                         /* 0x3004 */
	uint8_t az_width;                          /* 0x3005 */
	uint8_t s1r_width;                         /* 0x3006 */
	uint8_t tx_start;                          /* 0x3007 */
	uint8_t tx_width;                          /* 0x3008 */
	uint8_t stx_width;                         /* 0x3009 */
	uint8_t dtx_width;                         /* 0x300A */
	uint8_t rmp_rst_start;                     /* 0x300B */
	uint8_t rmp_sig_start;                     /* 0x300C */
	uint8_t rmp_lat;                           /* 0x300D */
	uint8_t v_binning_1;                       /* 0x300E */
	uint8_t reg_300F;                          /* 0x300F */
	uint8_t reg_301B;                          /* 0x301B */

	/* CDS option setting ... */
	uint8_t smp_en;                            /* 0x3010 */
	uint8_t rst_mx;                            /* 0x3011 */
	uint8_t reg_3029;                          /* 0x3029 */
	uint8_t sig_offset1;                       /* 0x3012 */
	uint8_t rst_offset1;                       /* 0x3013 */
	uint8_t sig_offset2;                       /* 0x3014 */
	uint8_t rst_offset2;                       /* 0x3015 */
	uint8_t adc_sat;                           /* 0x3016 */
	uint8_t rmp_init;                          /* 0x3017 */
	uint8_t rmp_option;                        /* 0x3018 */
	uint8_t clp_level;                         /* 0x301D */
	uint8_t inrush_ctrl;                       /* 0x3021 */
	uint8_t pump_ring_osc;                     /* 0x3022 */
	uint8_t pix_voltage;                       /* 0x3024 */
	uint8_t ntg_voltage;                       /* 0x3027 */
	uint8_t reg_30BC;                          /* 0x30BC */

	/* Pixel option setting ... */
	uint8_t pixel_bias;                        /* 0x301C */
	uint8_t all_tx_off;                        /* 0x30D8 */
	uint8_t reg_302B;                          /* 0x302B */

	/* ADLC setting ... */
	uint8_t l_adlc_bpr;                        /* 0x3070 */
	uint8_t f_l_adlc_max;                      /* 0x3071 */
	uint8_t f_adlc_filter_a;                   /* 0x3080 */
	uint8_t f_adlc_filter_b;                   /* 0x3081 */

	/* MIPI setting */
	uint8_t sel_ccp;                           /* 0x30BD */
	uint8_t sync_mode;                         /* 0x3084 */
	uint8_t m_pclk_div;                        /* 0x30BE */
	uint8_t pack_video_enable;                 /* 0x30C1 */
	uint8_t dphy_enable;                       /* 0x30EE */
	uint8_t embedded_data_off;                 /* 0x3111 */

	/* Integration setting ... */
	uint8_t coarse_integration_time;           /* 0x0202 */
	uint8_t coarse_integration_time_lsb;       /* 0x0203 */
	uint8_t analogue_gain_code_global_msb;     /* 0x0204 */
	uint8_t analogue_gain_code_global_lsb;     /* 0x0205 */

	/* Frame Length */
	uint8_t frame_length_lines_msb;            /* 0x0340 */
	uint8_t frame_length_lines_lsb;            /* 0x0341 */

	/* Line Length */
	uint8_t line_length_pck_msb;               /* 0x0342 */
	uint8_t line_length_pck_lsb;               /* 0x0343 */

	/* PLL setting ... */
	uint8_t pre_pll_clk_div;                   /* 0x0305 */
	uint8_t pll_multiplier_msb;                /* 0x0306 */
	uint8_t pll_multiplier_lsb;                /* 0x0307 */
	uint8_t vt_sys_clk_div;                    /* 0x30B5 */
	uint8_t outif_num_of_lanes;                /* 0x30E2 */
	uint8_t dphy_band_ctrl;                    /* 0x30F1 */

	/* MIPI Size Setting */
	uint8_t h_binning;                         /* 0x30A9 */
	uint8_t v_binning_2;                       /* 0x300E */
	uint8_t y_odd_inc_lsb_1;                   /* 0x0387 */

	/* MIPI Size Setting for preview */
	uint8_t x_addr_start_msb;                  /* 0x0344 */
	uint8_t x_addr_start_lsb;                  /* 0x0345 */
	uint8_t x_addr_end_msb;                    /* 0x0348 */
	uint8_t x_addr_end_lsb;                    /* 0x0349 */
	uint8_t y_addr_start_msb;                  /* 0x0346 */
	uint8_t y_addr_start_lsb;                  /* 0x0347 */
	uint8_t y_addr_end_msb;                    /* 0x034A */
	uint8_t y_addr_end_lsb;                    /* 0x034B */
	uint8_t x_even_inc_msb;                    /* 0x0380 */
	uint8_t x_even_inc_lsb;                    /* 0x0381 */
	uint8_t x_odd_inc_msb;                     /* 0x0382 */
	uint8_t x_odd_inc_lsb;                     /* 0x0383 */
	uint8_t y_even_inc_msb;                    /* 0x0384 */
	uint8_t y_even_inc_lsb;                    /* 0x0385 */
	uint8_t y_odd_inc_msb;                     /* 0x0386 */
	uint8_t y_odd_inc_lsb_2;                   /* 0x0387 */

	uint8_t x_output_size_msb;                 /* 0x034C */
	uint8_t x_output_size_lsb;                 /* 0x034D */
	uint8_t y_output_size_msb;                 /* 0x034E */
	uint8_t y_output_size_lsb;                 /* 0x034F */
	uint8_t outif_video_data_typel;            /* 0x30BF */
	uint8_t outif_offset_video;                /* 0x30C0 */
	uint8_t video_data_length_msb;             /* 0x30C8 */
	uint8_t video_data_length_lsb;             /* 0x30C9 */

	uint32_t size_h;
	uint32_t blk_l;
	uint32_t size_w;
	uint32_t blk_p;
};

struct reg_struct s5k4e1gx_reg_pat[2] = {
	{ /* Preview */
		// CDS timing setting ...
		0x05,    /* ld_start;                        REG=0x3000 */
		0x03,    /* sl_start;                        REG=0x3001 */
		0x08,    /* rx_start;                        REG=0x3002 */
		0x09,    /* cds_start;                       REG=0x3003 */
		0x2E,    /* smp_width;                       REG=0x3004 */
		0x06,    /* az_width;                        REG=0x3005 */
		0x34,    /* s1r_width;                       REG=0x3006 */
		0x00,    /* tx_start;                        REG=0x3007 */
		0x3C,    /* tx_width;                        REG=0x3008 */
		0x3C,    /* stx_width;                       REG=0x3009 */
		0x28,    /* dtx_width;                       REG=0x300A */
		0x04,    /* rmp_rst_start;                   REG=0x300B */
